In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt
import warnings
warnings.filterwarnings('ignore')
# import mysql.connector as sql
import sqlite3

from sqlalchemy import create_engine

#### STEPS FOR DATA CLEANING 
##### Check for Duplicates
##### Check for Nulls and replace with mean or median as the case may be

In [2]:
data_credit_profiles = pd.read_csv('./Data/credit_profiles.csv')
data_credit_profiles.head(3)

,cust_id,credit_score,credit_utilisation,outstanding_debt,credit_inquiries_last_6_months,credit_limit
0,1,749,0.585171,19571.0,0.0,40000.0
1,2,587,0.107928,161644.0,2.0,1250.0
2,3,544,0.854807,513.0,4.0,1000.0

In [3]:
data_credit_profiles.shape

(1004, 6)

In [4]:
data_customers = pd.read_csv('./Data/customers.csv')
data_customers.head(3)

,cust_id,name,gender,age,location,occupation,annual_income,marital_status
0,1,Manya Acharya,Female,2,City,Business Owner,358211.0,Married
1,2,Anjali Pandey,Female,47,City,Consultant,65172.0,Single
2,3,Aaryan Chauhan,Male,21,City,Freelancer,22378.0,Married

In [5]:
data_customers.shape

(1000, 8)

In [6]:
data_customers.isnull().sum()

cust_id            0
name               0
gender             0
age                0
location           0
occupation         0
annual_income     50
marital_status     0
dtype: int64

In [7]:
data_transactions = pd.read_csv('./Data/transactions.csv')
data_transactions.head(3)

,tran_id,cust_id,tran_date,tran_amount,platform,product_category,payment_type
0,1,705,2023-01-01,63,Flipkart,Electronics,Phonepe
1,2,385,2023-01-01,99,Alibaba,Fashion & Apparel,Credit Card
2,3,924,2023-01-01,471,Shopify,Sports,Phonepe

In [8]:
data_transactions.shape

(500000, 7)

##### median_income_by_occupation Gets the Median Value of annual income by occupation

In [9]:
median_income_by_occupation = data_customers.groupby('occupation')['annual_income'].median()
pd.DataFrame(median_income_by_occupation)

                     annual_income
occupation
Accountant                 65265.0
Artist                     45794.0
Business Owner            261191.5
Consultant                 58017.0
Data Scientist            135759.0
Freelancer                 46759.0
Fullstack Developer        76774.0

In [10]:
data_customers2 = data_customers.copy()

In [11]:
data_customers2.isnull().sum()

cust_id            0
name               0
gender             0
age                0
location           0
occupation         0
annual_income     50
marital_status     0
dtype: int64

In [12]:
pd.isnull('annual_income')

False

##### Treating Outliars in Annual Ancome dataset, 
#####  (get_med_val) replaces the null with the MEDIAN VALUE by Occupation derived above....

In [13]:
def get_med_val(row):
    if pd.isnull(row['annual_income']):
        return median_income_by_occupation[row['occupation']]
    else:
        return row['annual_income']

In [14]:
data_customers2['annual_income'] = data_customers2.apply(
    get_med_val,
    axis=1
)

##### Null Values successfully treated

In [15]:
data_customers2.isnull().sum()

cust_id           0
name              0
gender            0
age               0
location          0
occupation        0
annual_income     0
marital_status    0
dtype: int64

In [16]:
data_customers.isnull().sum()

cust_id            0
name               0
gender             0
age                0
location           0
occupation         0
annual_income     50
marital_status     0
dtype: int64

##### As per Business Requirments, minimum income us 100

In [17]:
data_customers2[data_customers2.annual_income< 100].shape

(10, 8)

In [18]:
for index, row in data_customers2.iterrows():
 if row['annual_income'] < 100:
  data_customers2.at[index,'annual_income'] = median_income_by_occupation[row['occupation']]

In [19]:
data_customers2[data_customers2.annual_income< 100].shape

(0, 8)

In [20]:
data_customers2['age']

0       2
1      47
2      21
3      24
4      48
       ..
995    26
996    55
997    29
998    47
999    28
Name: age, Length: 1000, dtype: int64

In [21]:
data_customers2['age'].isnull().sum()

0

##### As per Business Requirements, Minimum Age is 14 and Max age is 81

In [22]:
minAge = 14
maxAge= 81

In [23]:
minAge,maxAge

(14, 81)

In [24]:
outliarsData1 = data_customers2[(data_customers2.age<minAge)|(data_customers2.age>maxAge)]
outliarsData1

,cust_id,name,gender,age,location,occupation,annual_income,marital_status
0,1,Manya Acharya,Female,2,City,Business Owner,358211.0,Married
41,42,Aaryan Shah,Male,110,City,Artist,7621.0,Married
165,166,Sia Dutta,Female,1,City,Freelancer,39721.0,Single
174,175,Rohan Sharma,Male,110,City,Freelancer,23723.0,Married
222,223,Arjun Batra,Male,110,Suburb,Freelancer,210987.0,Married
277,278,Aarav Tandon,Male,110,City,Consultant,96522.0,Single
295,296,Ayush Pandey,Male,1,Rural,Accountant,55254.0,Married
325,326,Virat Goel,Male,110,City,Accountant,61021.0,Single
610,611,Rehan Verma,Male,135,Rural,Business Owner,444776.0,Married
692,693,Dhruv Jha,Male,1,City,Business Owner,83045.0,Married
703,704,Aanya Sharma,Female,110,City,Freelancer,43404.0,Single
709,710,Anika Verma,Female,110,City,Data Scientist,98417.0,Married
728,729,Rehan Yadav,Male,135,City,Business Owner,382836.0,Married
832,833,Ridhi Raj,Female,110,City,Fullstack Developer,95379.0,Single
845,846,Rohan Jaiswal,Male,1,City,Consultant,20838.0,Married
855,856,Aanya Taneja,Female,2,City,Fullstack Developer,30689.0,Married
895,896,Krishna Goswami,Male,1,City,Freelancer,31533.0,Married
923,924,Kunal Patel,Male,110,City,Freelancer,51629.0,Married
951,952,Virat Shetty,Male,135,City,Data Scientist,49677.0,Married
991,992,Arya Dube,Male,135,City,Fullstack Developer,93267.0,Single

In [25]:
outliarsData1.age.min()

1

In [26]:
outliarsData1.shape

(20, 8)

In [27]:
validData1 = data_customers2[(data_customers2.age>14)&(data_customers2.age<81)]
validData1

,cust_id,name,gender,age,location,occupation,annual_income,marital_status
1,2,Anjali Pandey,Female,47,City,Consultant,65172.0,Single
2,3,Aaryan Chauhan,Male,21,City,Freelancer,22378.0,Married
3,4,Rudra Bali,Male,24,Rural,Freelancer,33563.0,Married
4,5,Advait Malik,Male,48,City,Consultant,39406.0,Married
5,6,Arya Das,Male,22,City,Freelancer,44887.0,Married
...,...,...,...,...,...,...,...,...
995,996,Manya Vasudeva,Female,26,City,Freelancer,46759.0,Married
996,997,Aarav Dhawan,Male,55,City,Business Owner,290061.0,Single
997,998,Rehan Jha,Male,29,City,Fullstack Developer,139141.0,Married
998,999,Amara Rathore,Female,47,City,Business Owner,261191.5,Married
999,1000,Akshay Choudhary,Male,28,City,Freelancer,226873.0,Married

In [28]:
validData1.age.min()

18

In [29]:
data_customers2.age.median()

32.0

In [30]:
data_customers2.age.mean()

36.405

In [31]:
data_customers2.age.max()   #### Max Age

135

In [32]:
data_customers2.age.describe()

count    1000.000000
mean       36.405000
std        15.666155
min         1.000000
25%        26.000000
50%        32.000000
75%        46.000000
max       135.000000
Name: age, dtype: float64

In [33]:
median_age_by_occupation = data_customers.groupby('occupation')['age'].median()
pd.DataFrame(median_age_by_occupation)

                      age
occupation
Accountant           31.5
Artist               26.0
Business Owner       51.0
Consultant           46.0
Data Scientist       32.0
Freelancer           24.0
Fullstack Developer  27.5

In [34]:
data_customers.annual_income

0      358211.0
1       65172.0
2       22378.0
3       33563.0
4       39406.0
         ...
995         NaN
996    290061.0
997    139141.0
998         NaN
999    226873.0
Name: annual_income, Length: 1000, dtype: float64

In [35]:
data_customers2.age.min(),data_customers2.age.max()

(1, 135)

##### Here we loop tru the index of the outliars, then match them with the index of the main df, and have replaced with the new median

In [36]:
for index, row in outliarsData1.iterrows():
  data_customers2.at[index,'age'] = median_age_by_occupation[row['occupation']]

##### New Data Set has min age 18 and Max Age 64 so means outliars have been treated

In [37]:
data_customers2.age.min(),data_customers2.age.max()

(18.0, 64.0)

In [38]:
data_customers2[(data_customers2.age<14)|(data_customers2.age>81)]

Empty DataFrame
Columns: [cust_id, name, gender, age, location, occupation, annual_income, marital_status]
Index: []

In [39]:
data_customers2.describe()

           cust_id          age  annual_income
count  1000.000000  1000.000000    1000.000000
mean    500.500000    35.541500  140483.548500
std     288.819436    12.276634  110463.002934
min       1.000000    18.000000    5175.000000
25%     250.750000    26.000000   49620.500000
50%     500.500000    32.000000  115328.000000
75%     750.250000    44.250000  195514.250000
max    1000.000000    64.000000  449346.000000

##### Data Cleaned and Ourliars removed

In [40]:
data_customers2.age.min(),data_customers2.age.max()

(18.0, 64.0)

In [41]:
data_customers2.annual_income.min(),data_customers2.annual_income.max()

(5175.0, 449346.0)

In [42]:
data_customers2.shape

(1000, 8)

In [43]:
data_customers2.to_csv('./CleanData/clean_annual_income_and_age.csv', index = True)

#### Task
##### Figure Out Income Distribution by Age, Occupation, Gender and Location age MUST be between 15 and 85

In [44]:
data_customers2.age.min(), data_customers2.age.max()

(18.0, 64.0)

In [45]:
data_customers2.annual_income.min(), data_customers2.annual_income.max()

(5175.0, 449346.0)

In [46]:
pd.DataFrame(data_customers2.columns)

                0
0         cust_id
1            name
2          gender
3             age
4        location
5      occupation
6   annual_income
7  marital_status

In [47]:
data_customers2.gender.value_counts(dropna=False)

Male      674
Female    326
Name: gender, dtype: int64

In [48]:
data_customers2.location.value_counts(dropna=False)

City      683
Suburb    232
Rural      85
Name: location, dtype: int64

In [49]:
data_customers2.occupation.value_counts(dropna=False)

Business Owner         289
Freelancer             228
Data Scientist         184
Fullstack Developer    148
Consultant              97
Artist                  38
Accountant              16
Name: occupation, dtype: int64

In [50]:
data_customers2.marital_status.value_counts(dropna=False)

Married    775
Single     225
Name: marital_status, dtype: int64

In [51]:
annualincome_by_ms = data_customers.groupby('marital_status')['annual_income'].median()
pd.DataFrame(annualincome_by_ms)

                annual_income
marital_status
Married              111799.0
Single               113402.5

In [52]:
annualincome_by_ms = data_customers.groupby('marital_status')['annual_income'].mean()
pd.DataFrame(annualincome_by_ms)

                annual_income
marital_status
Married         138613.222973
Single          142219.114286

In [53]:
annualincome_occup = data_customers.groupby('occupation')['annual_income','age'].mean()
pd.DataFrame(annualincome_occup)

                     annual_income        age
occupation
Accountant            64123.562500  34.812500
Artist                45267.685714  28.236842
Business Owner       264976.866906  49.740484
Consultant            58989.786517  45.680412
Data Scientist       135524.215569  33.157609
Freelancer            76990.479821  25.184211
Fullstack Developer   78270.225352  27.878378

In [54]:
annualincome_age = round(data_customers.groupby('occupation')['annual_income','age'].mean(),1)
pd.DataFrame(annualincome_age)

                     annual_income   age
occupation
Accountant                 64123.6  34.8
Artist                     45267.7  28.2
Business Owner            264976.9  49.7
Consultant                 58989.8  45.7
Data Scientist            135524.2  33.2
Freelancer                 76990.5  25.2
Fullstack Developer        78270.2  27.9

In [55]:
location_gender = data_customers.groupby('location')['gender'].count()
pd.DataFrame(location_gender)

          gender
location
City         683
Rural         85
Suburb       232

In [56]:
location_gender2 = data_customers.groupby(['gender','location'])['location'].count()
pd.DataFrame(location_gender2)

                 location
gender location
Female City           226
       Rural           26
       Suburb          74
Male   City           457
       Rural           59
       Suburb         158

In [57]:
# engine = create_engine('mysql+pymysql://root:juud@host:3306/e_master_card')